// pageTracker._trackPageview("events/market/ttzj/hangzhou");

/*

		"name": "",
        "imgs": ["img/4.jpg"],
        "introduction":"",
        "reservation":"",
        "promotion": "",
        "coupon": "",
        "link": "",
        "member":""
*/

//0-美甲 1-美发 2-遇见 3-密室 4-舌尖
window.type = '4';
window.storeList = [{
    "": "",
    "序号": "1",
    "参与主题": "舌尖上的北京",
    "商户名称": "宽板凳",
    "商户主页面链接": "http://www.dianping.com/search/keyword/2/0_%E5%AE%BD%E6%9D%BF%E5%87%B3%E8%80%81%E7%81%B6%E7%81%AB%E9%94%85",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "宽板凳老灶火锅以宣扬重庆100多年历史的最正宗的老灶火锅为初衷，把重庆独具魅力的、原滋原味的、脍炙人口的饮食文化带给历史文化古都及来自五湖四海的朋友们！“宽板凳”一直以“弘扬和传承重庆老火锅文化”为使命，无论是店面的装修风格、餐具还是味道，都保持着重庆老火锅的风格。在重庆火锅特色食材上的选用也是精心由重庆挑选后空运上北京的，如宽板凳鲜毛肚、宽板凳鲜鹅肠等。",
    "商户图片（logo/环境/菜品均可）": "",
    "参与活动商户团购deal 链接": "http://t.dianping.com/deal/2308843",
    "参与活动商户优惠券链接": "http://t.dianping.com/deal/2308843",
    "参与活动商户预定链接": "http://t.dianping.com/deal/2308843",
    "参与活动商户会员卡链接": "http://t.dianping.com/deal/2308843",
    "商业活动售卖金额": "4万",
    "奖品/使用规则": "宽板凳老灶火锅200元代金券             使用规则：有效期截止2014.7. 15 \n仅限堂食\n不可与其他优惠同享\n此券不开具发票。",
    "奖品份数": "50份"
}, {
    "": "",
    "序号": "2",
    "参与主题": "舌尖上的北京",
    "商户名称": "江边城外烤全鱼",
    "商户主页面链接": "http://www.dianping.com/search/keyword/2/0_%E6%B1%9F%E8%BE%B9",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "江边鱼美，城外留香。从巴蜀到北京到上海再到全国，江边城外以其正宗而独特的味道，不断给越来越多的人带来味觉的享受和快乐——香辣味醇厚香鲜而回甜，香气独特，光是精美的造型、色彩斑斓的外观，就足以令您三尺垂涎；怪味咸甜酸麻辣咸香并重而协调，犹如人生各般滋味在这里一应俱全，深受年轻人的青睐；曼妙的蒜香味将鱼肉本身略带的土腥味完美掩盖，一口下去，多种不同的辛辣鲜香味冲击着你的味蕾，是美食养生达人的不二之选；阳江豆豉颗粒玲珑，豉味更加浓，在加上芹菜段，彩椒粒配上现烤的鱼肉光是看着就让人按耐不住了……更重要的是，百闻不如一尝啊，一般人真不爱告诉他们！",
    "商户图片（logo/环境/菜品均可）": "logo1张              \n 商户展示大图1张（尺寸：180×180） ",
    "参与活动商户团购deal 链接": "无",
    "参与活动商户优惠券链接": "http://www.dianping.com/promo/217146?source=6",
    "参与活动商户预定链接": "无",
    "参与活动商户会员卡链接": "无",
    "商业活动售卖金额": "3万",
    "奖品/使用规则": "江边城外烤全鱼餐厅100元代金券/                 使用规则：有效期截止2014.7.1-2014.12.31，仅限使用一次 \n不提供外送服务\n可累积使用，不兑现、不找零，仅限一次性使用\n不可抵扣酒水；不可与其他优惠同享，仅限堂食\n此券不开具发票。\n",
    "奖品份数": "20份100元代金券"
}, {
    "": "",
    "序号": "3",
    "参与主题": "舌尖上的北京",
    "商户名称": "100元代金券(小蜜蜂蛋糕)",
    "商户主页面链接": "http://www.dianping.com/shop/3215671",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "ebeecake 易贝可（北京）食品有限公司，诞生于北京798艺术区。于2009年7月29号开始面向北京蛋糕爱好者服务以来，受到了很多客户的青睐。其产品的设计理念融入了亲情，爱情。从这小小的一块蛋糕体现了一份责任，对社会的责任，对爱人的责任，对家庭的责任..... 798 创意区为思想者提供了热土。它极具包容性，任何独特、独到、独立的创意都可以在这里得到滋养，成长！ebeecake在798的氛围中创造着生活的甜蜜。 ebeecake是分享幸福、倡导健康生活的使者，是网络时代的蜜蜂家族。 ebeecake带给您的不仅是蛋糕纯正的味道，还有每款蛋糕独特的情感蜜码。它让你在品味蛋糕时还可以放松心情，得到优质的生活享受。您可以通过网站和电话订制使你幸福、激动的那款健康蛋糕；快速，便捷，无处不在的订购和六环内免费配送的服务让你收到那“一分”小幸福时，可以与你周围的人一起分享，让他们共同体会“十分”的幸福和快乐。",
    "商户图片（logo/环境/菜品均可）": "logo1张              \n 商户展示大图1张（尺寸：180×180） ",
    "参与活动商户团购deal 链接": "http://t.dianping.com/deal/6143378",
    "参与活动商户优惠券链接": "无",
    "参与活动商户预定链接": "无",
    "参与活动商户会员卡链接": "http://www.dianping.com/card/detail/c3_b3215671_a22",
    "商业活动售卖金额": "2.5万",
    "奖品/使用规则": "ebeecake蛋糕(小蜜蜂蛋糕)100元代金券                                        规则：有效期截止2014.7.31  \n不可累积使用，不兑现、不找零，仅限一次性使用                               不可与其他优惠同享                        提前5小时预订  北京市六环内免费送货，订购热线：4006-106-798\n此券不开具发票。\n",
    "奖品份数": "300份"
}, {
    "": "",
    "序号": "4",
    "参与主题": "舌尖上的北京",
    "商户名称": "兄弟川菜",
    "商户主页面链接": "http://www.dianping.com/search/keyword/2/0_%E5%85%84%E5%BC%9F%E5%B7%9D%E8%8F%9C",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "兄弟川菜（帮朱少瑾）：品质川菜，正宗食飨 \n 15年来，兄弟川菜品质如一，深受广大食客喜爱。泉水牛蛙、毛血旺、麻辣龙虾、口水鸡等等总是让人赞不绝口。环境时尚又不失中国风，非常适合朋友家人聚餐、情侣约会。兄弟川菜旗舰店（又名川上四季）又是一个新亮点，一二楼是一样的川菜，一样的优美环境，三楼有新开业露天花园大排档。有没有心动呢？心动不如行动，想吃正宗请到兄弟川菜！经营宗旨：做更好吃的川菜，提供更体贴的服务！",
    "商户图片（logo/环境/菜品均可）": "见附件",
    "参与活动商户团购deal 链接": "http://www.dianping.com/search/keyword/2/0_%E5%85%84%E5%BC%9F%E5%B7%9D%E8%8F%9C",
    "参与活动商户优惠券链接": "http://www.dianping.com/search/keyword/2/0_%E5%85%84%E5%BC%9F%E5%B7%9D%E8%8F%9C",
    "参与活动商户预定链接": "http://www.dianping.com/search/keyword/2/0_%E5%85%84%E5%BC%9F%E5%B7%9D%E8%8F%9C",
    "参与活动商户会员卡链接": "http://www.dianping.com/search/keyword/2/0_%E5%85%84%E5%BC%9F%E5%B7%9D%E8%8F%9C",
    "商业活动售卖金额": "2万",
    "奖品/使用规则": "兄弟川菜-价值89元泉水牛蛙1份            使用规则：有效期截止2014.7. 15 \n仅限堂食，簋街老店、簋街旗舰元大都、回龙观4店通用\n不可与其他优惠同享\n此券不开具发票。",
    "奖品份数": "50份"
}, {
    "": "",
    "序号": "5",
    "参与主题": "舌尖上的北京",
    "商户名称": "ROUTE 66",
    "商户主页面链接": "http://www.dianping.com/shop/18014415",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "66 ROUTE（中文：66号公路）是一家以纯正西式简餐，BBQ，酒吧为主的个性餐吧。精选的食材，考究的烹饪，为您带来独一无二的美食享受，并且，店内有120多种来自世界各地的精酿啤酒，不管是黑啤、白啤、黄啤、还是果啤，在这里，总有一款啤酒是为你准备的。地道的美式就餐环境，纯正的美式西餐，超百种的优质啤酒，你还不赶紧拿起电话呼朋引伴！",
    "商户图片（logo/环境/菜品均可）": "logo1张              \n 商户展示大图1张（尺寸：180×180） ",
    "参与活动商户团购deal 链接": "http://t.dianping.com/deal/6060012",
    "参与活动商户优惠券链接": "http://www.dianping.com/promo/225068?source=6",
    "参与活动商户预定链接": "无",
    "参与活动商户会员卡链接": "无",
    "商业活动售卖金额": "1.5万",
    "奖品/使用规则": "ROUTE 66 双人套餐                    使用规则：有效期截止2014.7.31  \n不提供外送服务\n不可累积使用，不兑现、不找零，仅限一次性使用\n不可与其他优惠同时享用\n此券不开具发票。\n",
    "奖品份数": "20份"
}, {
    "": "",
    "序号": "6",
    "参与主题": "舌尖上的北京",
    "商户名称": "品贵小馆",
    "商户主页面链接": "http://www.dianping.com/shop/18188934",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "常言道：“民以食为天”。到某一个地方去观光游览，除了玩，当然就要好好的品尝一下具有本地特色的佳肴了.到贵州省你就要仔仔细细地去品味当地有名的小吃了.如果在北京您想吃贵州菜了，不用大老远的跑去贵州，来品贵，让您品尝到地道的，纯正的口味，品贵小馆欢迎您的到来！",
    "商户图片（logo/环境/菜品均可）": "logo1张              \n 商户展示大图1张（尺寸：180×180） ",
    "参与活动商户团购deal 链接": "无",
    "参与活动商户优惠券链接": "无",
    "参与活动商户预定链接": "无",
    "参与活动商户会员卡链接": "无",
    "商业活动售卖金额": "1.5万",
    "奖品/使用规则": "100元代金券                              使用规则：有效期截止2014.7.31  \n不提供外送服务\n不可累积使用，不兑现、不找零，仅限一次性使用\n不可与其他优惠同时享用\n此券不开具发票。\n",
    "奖品份数": "50份"
}, {
    "": "",
    "序号": "7",
    "参与主题": "舌尖上的北京",
    "商户名称": "西部马华牛肉面",
    "商户主页面链接": "http://www.dianping.com/search/keyword/2/0_%E8%A5%BF%E9%83%A8%E9%A9%AC%E5%8D%8E%E7%89%9B%E8%82%89%E9%9D%A2",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "西部马华牛肉面\n\n特色推荐菜：招牌骨汤牛肉面、红椒土鸡大盘鸡\n西部马华的招牌骨汤牛肉面，纯正兰州口味，大块牛肉，吃得过瘾；面条由进口澳麦面粉手工制作，劲道有味儿。除了正宗的西北风味牛肉面以外，红椒土鸡大盘鸡也是必点的美味。选用农家土鸡，肉质鲜美细嫩，再配上爽口的红椒，颜色鲜艳饱满，令人垂涎欲滴。来西部马华，感受西北风味，真是一副“大漠炊烟直，方桌大盘圆”的边塞气象。",
    "商户图片（logo/环境/菜品均可）": "logo1张              \n 商户展示大图1张（尺寸：180×180） ",
    "参与活动商户团购deal 链接": "无",
    "参与活动商户优惠券链接": "无",
    "参与活动商户预定链接": "无",
    "参与活动商户会员卡链接": "无",
    "商业活动售卖金额": "1万",
    "奖品/使用规则": "西部马华100元代金券                  使用规则：有效期截止2014.7.31  \n不提供外送服务\n不兑现、不找零，仅限一次性使用\n不可抵扣酒水；不可与其他优惠同享\n此券不开具发票。\n",
    "奖品份数": "50份"
}, {
    "": "",
    "序号": "",
    "参与主题": "",
    "商户名称": "",
    "商户主页面链接": "",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "",
    "商户图片（logo/环境/菜品均可）": "",
    "参与活动商户团购deal 链接": "",
    "参与活动商户优惠券链接": "",
    "参与活动商户预定链接": "",
    "参与活动商户会员卡链接": "",
    "商业活动售卖金额": "",
    "奖品/使用规则": "",
    "奖品份数": ""
}, {
    "": "",
    "序号": "",
    "参与主题": "",
    "商户名称": "",
    "商户主页面链接": "",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "",
    "商户图片（logo/环境/菜品均可）": "",
    "参与活动商户团购deal 链接": "",
    "参与活动商户优惠券链接": "",
    "参与活动商户预定链接": "",
    "参与活动商户会员卡链接": "",
    "商业活动售卖金额": "",
    "奖品/使用规则": "",
    "奖品份数": ""
}, {
    "": "",
    "序号": "",
    "参与主题": "",
    "商户名称": "",
    "商户主页面链接": "",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "",
    "商户图片（logo/环境/菜品均可）": "",
    "参与活动商户团购deal 链接": "",
    "参与活动商户优惠券链接": "",
    "参与活动商户预定链接": "",
    "参与活动商户会员卡链接": "",
    "商业活动售卖金额": "",
    "奖品/使用规则": "",
    "奖品份数": ""
}, {
    "": "",
    "序号": "",
    "参与主题": "",
    "商户名称": "",
    "商户主页面链接": "",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "",
    "商户图片（logo/环境/菜品均可）": "",
    "参与活动商户团购deal 链接": "",
    "参与活动商户优惠券链接": "",
    "参与活动商户预定链接": "",
    "参与活动商户会员卡链接": "",
    "商业活动售卖金额": "",
    "奖品/使用规则": "",
    "奖品份数": ""
}, {
    "": "",
    "序号": "",
    "参与主题": "",
    "商户名称": "",
    "商户主页面链接": "",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "",
    "商户图片（logo/环境/菜品均可）": "",
    "参与活动商户团购deal 链接": "",
    "参与活动商户优惠券链接": "",
    "参与活动商户预定链接": "",
    "参与活动商户会员卡链接": "",
    "商业活动售卖金额": "",
    "奖品/使用规则": "",
    "奖品份数": ""
}, {
    "": "",
    "序号": "",
    "参与主题": "",
    "商户名称": "",
    "商户主页面链接": "",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "",
    "商户图片（logo/环境/菜品均可）": "",
    "参与活动商户团购deal 链接": "",
    "参与活动商户优惠券链接": "",
    "参与活动商户预定链接": "",
    "参与活动商户会员卡链接": "",
    "商业活动售卖金额": "",
    "奖品/使用规则": "",
    "奖品份数": ""
}, {
    "": "",
    "序号": "",
    "参与主题": "",
    "商户名称": "",
    "商户主页面链接": "",
    "商户简介（200字内）或者\n菜品介绍（200字内）": "",
    "商户图片（logo/环境/菜品均可）": "",
    "参与活动商户团购deal 链接": "",
    "参与活动商户优惠券链接": "",
    "参与活动商户预定链接": "",
    "参与活动商户会员卡链接": "",
    "商业活动售卖金额": "",
    "奖品/使用规则": "",
    "奖品份数": ""
}] ;



(function(){
    var shopDic = {
    '商户名称':'name',
    '序号':'id',
    "商户主页面链接":'link',
    "商户简介（200字内）或者\n菜品介绍（200字内）":"introduction",
    "参与活动商户团购deal 链接":"coupon",
    "参与活动商户优惠券链接":"promotion",
    "参与活动商户预定链接":"reservation",
    "参与活动商户会员卡链接":"member"
    }
    for (var i = 0 ; i < window.storeList.length ; i++) {
        shopInfo = window.storeList[i]
        for (var item in shopInfo){
            if (shopDic[item]!= null) {
                
                if (shopInfo[item].trim() == "无") {
                    shopInfo[item] = "";
                }
                shopInfo[shopDic[item]] = shopInfo[item];
                delete shopInfo[item]
            } else {
                delete shopInfo[item]
            }
        }

        if (shopInfo['id'] == ""){
            var index = window.storeList.indexOf(shopInfo);  
                if (index > -1) {  
                    window.storeList.splice(index)
                }
        }

        shopInfo.imgs = ['img/1-'+(i+1)+'.jpg'];
        //console.log(shopInfo)
        
    }
    
})()