[
    {
        "shop": "晶采轩(芮欧百货店)",
        "address": "南京西路1601号芮欧百货3-4楼(近常德路)",
        "tel": "021-64721717 66315757",
        "promo": "1"
    },
    {
        "shop": "越由七莘路店",
        "address": "七莘路1886号(华友路口)",
        "tel": "021-34632579 34632577",
        "promo": "2"
    },
    {
        "shop": "汉唐",
        "address": "桃林路777号(近张杨路)",
        "tel": "021-58727777",
        "promo": "3"
    },
    {
        "shop": "豪辣麻辣火锅（打浦桥店）",
        "address": "瑞金南路1号海兴广场2楼(日月光对面)",
        "tel": "021-64177879",
        "promo": "4"
    },
    {
        "shop": "浦江潮",
        "address": "滨江大道1850号(近浦东南路)",
        "tel": "021-50988677",
        "promo": "5"
    },
    {
        "shop": "唐宫海鲜舫(浦东店) ",
        "address": "陆家嘴西路168号正大广场6楼11-13号铺",
        "tel": "021-50988868 50988588",
        "promo": "6"
    },
    {
        "shop": "唐宫(维景店)",
        "address": "东诸安浜路103号维景酒店公寓1-2楼(近江苏路)",
        "tel": "021-62516148 62513960",
        "promo": "6"
    },
    {
        "shop": "唐宫海鲜舫(花木店)",
        "address": "樱花路869号证大喜玛拉雅中心5楼103-104房",
        "tel": "021-68819099 68819388",
        "promo": "6"
    },
    {
        "shop": "唐宫膳(虹口店)",
        "address": "大连路555号(近昆明路)",
        "tel": "021-65410277 65417588",
        "promo": "6"
    },
    {
        "shop": "唐宫海鲜舫(889广场店) ",
        "address": "万航渡路889号悦达889广场4楼",
        "tel": "021-32523909 32520669",
        "promo": "6"
    },
    {
        "shop": "唐宫海鲜舫(白玉兰店)",
        "address": "四平路1251号白玉兰宾馆2楼",
        "tel": "021-55133998 55133918",
        "promo": "6"
    },
    {
        "shop": "唐宫海鲜舫(银河店)",
        "address": "中山西路888号银河宾馆2楼(近延安西路)",
        "tel": "021-62198898 62755888",
        "promo": "6"
    }
]